Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_otg2_hs_device.h
#define OTG2_HS_DEVICE_OTG_HS_DCTL_POPRGDNE                 (0x1U<<11)
#define OTG2_HS_DEVICE_OTG_HS_DCTL_CGONAK                   (0x1U<<10)
#define OTG2_HS_DEVICE_OTG_HS_DCTL_SGONAK                   (0x1U<<9)
#define OTG2_HS_DEVICE_OTG_HS_DCTL_CGINAK                   (0x1U<<8)
#define OTG2_HS_DEVICE_OTG_HS_DCTL_SGINAK                   (0x1U<<7)
#define OTG2_HS_DEVICE_OTG_HS_DCTL_TCTL                     (0x7U<<4)
#define OTG2_HS_DEVICE_OTG_HS_DCTL_TCTL_0                   (0x1U<<4)
#define OTG2_HS_DEVICE_OTG_HS_DCTL_GONSTS                   (0x1U<<3)
#define OTG2_HS_DEVICE_OTG_HS_DCTL_GINSTS                   (0x1U<<2)
#define OTG2_HS_DEVICE_OTG_HS_DCTL_SDIS                     (0x1U<<1)
#define OTG2_HS_DEVICE_OTG_HS_DCTL_RWUSIG                   (0x1U<<0)

// OTG_HS_DSTS Configuration

#define OTG2_HS_DEVICE_OTG_HS_DSTS_FNSOF                    (0x3FFFU<<8)
#define OTG2_HS_DEVICE_OTG_HS_DSTS_FNSOF_0                  (0x1U<<8)
#define OTG2_HS_DEVICE_OTG_HS_DSTS_EERR                     (0x1U<<3)
#define OTG2_HS_DEVICE_OTG_HS_DSTS_ENUMSPD                  (0x3U<<1)
#define OTG2_HS_DEVICE_OTG_HS_DSTS_ENUMSPD_0                (0x1U<<1)
#define OTG2_HS_DEVICE_OTG_HS_DSTS_SUSPSTS                  (0x1U<<0)

// OTG_HS_DIEPMSK Configuration

#define OTG2_HS_DEVICE_OTG_HS_DIEPMSK_BIM                   (0x1U<<9)
#define OTG2_HS_DEVICE_OTG_HS_DIEPMSK_TXFURM                (0x1U<<8)
#define OTG2_HS_DEVICE_OTG_HS_DIEPMSK_INEPNEM               (0x1U<<6)
#define OTG2_HS_DEVICE_OTG_HS_DIEPMSK_INEPNMM               (0x1U<<5)
#define OTG2_HS_DEVICE_OTG_HS_DIEPMSK_ITTXFEMSK             (0x1U<<4)
#define OTG2_HS_DEVICE_OTG_HS_DIEPMSK_TOM                   (0x1U<<3)
#define OTG2_HS_DEVICE_OTG_HS_DIEPMSK_EPDM                  (0x1U<<1)
#define OTG2_HS_DEVICE_OTG_HS_DIEPMSK_XFRCM                 (0x1U<<0)

// OTG_HS_DOEPMSK Configuration

#define OTG2_HS_DEVICE_OTG_HS_DOEPMSK_BOIM                  (0x1U<<9)
#define OTG2_HS_DEVICE_OTG_HS_DOEPMSK_OPEM                  (0x1U<<8)
#define OTG2_HS_DEVICE_OTG_HS_DOEPMSK_B2BSTUP               (0x1U<<6)
#define OTG2_HS_DEVICE_OTG_HS_DOEPMSK_OTEPDM                (0x1U<<4)
#define OTG2_HS_DEVICE_OTG_HS_DOEPMSK_STUPM                 (0x1U<<3)
#define OTG2_HS_DEVICE_OTG_HS_DOEPMSK_EPDM                  (0x1U<<1)
#define OTG2_HS_DEVICE_OTG_HS_DOEPMSK_XFRCM                 (0x1U<<0)

// OTG_HS_DAINT Configuration

#define OTG2_HS_DEVICE_OTG_HS_DAINT_OEPINT                  (0xFFFFU<<16)
#define OTG2_HS_DEVICE_OTG_HS_DAINT_OEPINT_0                (0x1U<<16)
#define OTG2_HS_DEVICE_OTG_HS_DAINT_IEPINT                  (0xFFFFU<<0)
#define OTG2_HS_DEVICE_OTG_HS_DAINT_IEPINT_0                (0x1U<<0)

// OTG_HS_DAINTMSK Configuration

#define OTG2_HS_DEVICE_OTG_HS_DAINTMSK_OEPM                 (0xFFFFU<<16)
#define OTG2_HS_DEVICE_OTG_HS_DAINTMSK_OEPM_0               (0x1U<<16)
#define OTG2_HS_DEVICE_OTG_HS_DAINTMSK_IEPM                 (0xFFFFU<<0)
#define OTG2_HS_DEVICE_OTG_HS_DAINTMSK_IEPM_0               (0x1U<<0)

// OTG_HS_DVBUSDIS Configuration

#define OTG2_HS_DEVICE_OTG_HS_DVBUSDIS_VBUSDT               (0xFFFFU<<0)
#define OTG2_HS_DEVICE_OTG_HS_DVBUSDIS_VBUSDT_0             (0x1U<<0)

// OTG_HS_DVBUSPULSE Configuration

#define OTG2_HS_DEVICE_OTG_HS_DVBUSPULSE_DVBUSP             (0xFFFU<<0)
#define OTG2_HS_DEVICE_OTG_HS_DVBUSPULSE_DVBUSP_0           (0x1U<<0)

// OTG_HS_DTHRCTL Configuration

#define OTG2_HS_DEVICE_OTG_HS_DTHRCTL_ARPEN                 (0x1U<<27)
#define OTG2_HS_DEVICE_OTG_HS_DTHRCTL_RXTHRLEN              (0x1FFU<<17)
#define OTG2_HS_DEVICE_OTG_HS_DTHRCTL_RXTHRLEN_0            (0x1U<<17)
#define OTG2_HS_DEVICE_OTG_HS_DTHRCTL_RXTHREN               (0x1U<<16)
#define OTG2_HS_DEVICE_OTG_HS_DTHRCTL_TXTHRLEN              (0x1FFU<<2)
#define OTG2_HS_DEVICE_OTG_HS_DTHRCTL_TXTHRLEN_0            (0x1U<<2)
#define OTG2_HS_DEVICE_OTG_HS_DTHRCTL_ISOTHREN              (0x1U<<1)
#define OTG2_HS_DEVICE_OTG_HS_DTHRCTL_NONISOTHREN           (0x1U<<0)

// OTG_HS_DIEPEMPMSK Configuration

#define OTG2_HS_DEVICE_OTG_HS_DIEPEMPMSK_INEPTXFEM          (0xFFFFU<<0)
#define OTG2_HS_DEVICE_OTG_HS_DIEPEMPMSK_INEPTXFEM_0        (0x1U<<0)

// OTG_HS_DEACHINT Configuration

#define OTG2_HS_DEVICE_OTG_HS_DEACHINT_OEP1INT              (0x1U<<17)
#define OTG2_HS_DEVICE_OTG_HS_DEACHINT_IEP1INT              (0x1U<<1)

// OTG_HS_DEACHINTMSK Configuration

#define OTG2_HS_DEVICE_OTG_HS_DEACHINTMSK_OEP1INTM          (0x1U<<17)
#define OTG2_HS_DEVICE_OTG_HS_DEACHINTMSK_IEP1INTM          (0x1U<<1)

// OTG_HS_DIEPCTL0 Configuration

#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_EPENA                (0x1U<<31)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_EPDIS                (0x1U<<30)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_SODDFRM              (0x1U<<29)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_SD0PID_SEVNFRM       (0x1U<<28)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_SNAK                 (0x1U<<27)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_CNAK                 (0x1U<<26)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_TXFNUM               (0xFU<<22)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_TXFNUM_0             (0x1U<<22)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_STALL                (0x1U<<21)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_EPTYP                (0x3U<<18)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_EPTYP_0              (0x1U<<18)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_NAKSTS               (0x1U<<17)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_EONUM_DPID           (0x1U<<16)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_USBAEP               (0x1U<<15)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_MPSIZ                (0x7FFU<<0)
#define OTG2_HS_DEVICE_OTG_HS_DIEPCTL0_MPSIZ_0              (0x1U<<0)

// OTG_HS_DIEPINT0 Configuration

#define OTG2_HS_DEVICE_OTG_HS_DIEPINT0_NAK                  (0x1U<<13)
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT0_BERR                 (0x1U<<12)
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT0_PKTDRPSTS            (0x1U<<11)
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT0_BNA                  (0x1U<<9)
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT0_TXFIFOUDRN           (0x1U<<8)
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT0_TXFE                 (0x1U<<7)
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT0_INEPNE               (0x1U<<6)
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT0_ITTXFE               (0x1U<<4)
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT0_TOC                  (0x1U<<3)
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT0_EPDISD               (0x1U<<1)
#define OTG2_HS_DEVICE_OTG_HS_DIEPINT0_XFRC                 (0x1U<<0)

// OTG_HS_DIEPTSIZ0 Configuration

#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ0_PKTCNT              (0x3U<<19)
#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ0_PKTCNT_0            (0x1U<<19)
#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ0_XFRSIZ              (0x7FU<<0)
#define OTG2_HS_DEVICE_OTG_HS_DIEPTSIZ0_XFRSIZ_0            (0x1U<<0)

// OTG_HS_DIEPDMA1 Configuration

#define OTG2_HS_DEVICE_OTG_HS_DIEPDMA1_DMAADDR              (0xFFFFFFFFU<<0)
#define OTG2_HS_DEVICE_OTG_HS_DIEPDMA1_DMAADDR_0            (0x1U<<0)

